OpenFOAM-7/tutorials/multiphase/interFoam/laminar/sloshingCylinder/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       off;

geometry
{
    sloshingCylinder
    {
        type closedTriSurfaceMesh;
        file "sloshingCylinder.obj";
    }
};

castellatedMeshControls
{
    features
    (
    );

    refinementSurfaces
    {
        sloshingCylinder
        {
            level (1 1);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        sloshingCylinder
        {
            mode inside;
            levels ((1E15 1));
        }
    }

    locationInMesh (1e-5 1e-5 1e-5);
}

snapControls
{
    explicitFeatureSnap    false;
    implicitFeatureSnap    false;
}

addLayersControls
{
    layers
    {
    }

    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-3;
}

writeFlags
(
);

mergeTolerance 1e-6;

// ************************************************************************* //
